tap "aws/tap"
tap "powershell/tap"
brew "xz"
brew "node"
brew "ask-cli"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "python@3.13"
brew "aws-sam-cli"
brew "awscli"
brew "azure-cli"
brew "caddy"
brew "glib"
brew "cloc"
brew "cmake"
brew "colordiff"
brew "cookiecutter"
brew "coreutils"
brew "cowsay"
brew "diff-so-fancy"
brew "docutils"
brew "ffmpeg"
brew "fortune"
brew "gcc"
brew "gifsicle"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "git-tools"
brew "gnupg"
brew "harfbuzz"
brew "uv"
brew "hatch"
brew "htop"
brew "imagemagick"
brew "jq"
brew "libdvdread"
brew "libdvdnav"
brew "libgit2"
brew "nmap"
brew "node@22"
brew "openjdk"
brew "pinentry-mac"
brew "protobuf"
brew "pyenv"
brew "pygments"
brew "python-tk@3.11"
brew "rust"
brew "showkey"
brew "tcl-tk"
brew "trash"
cask "blackhole-2ch"
cask "codex"
cask "font-meslo-lg-nerd-font"
cask "git-credential-manager"
cask "monitorcontrol"
cask "proxy-audio-device"
vscode "akamud.vscode-theme-onedark"
vscode "akamud.vscode-theme-onelight"
vscode "amedomary.touchbarvscode"
vscode "anthropic.claude-code"
vscode "austenc.tailwind-docs"
vscode "bierner.markdown-preview-github-styles"
vscode "champgm.cloudformation-yaml-validator"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "daelonsuzuka.nicegui"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "felipe.nasc-touchbar"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "idleberg.applescript"
vscode "idleberg.jxa"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "michelemelluso.gitignore"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "platformio.platformio-ide"
vscode "redhat.vscode-yaml"
vscode "ronnidc.nunjucks"
vscode "rubymaniac.vscode-paste-and-indent"
vscode "sodatea.velocity"
vscode "tamasfe.even-better-toml"
vscode "textualize.textual-syntax-highlighter"
vscode "twxs.cmake"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
