tap "aws/tap"
tap "powershell/tap"
brew "xz"
brew "node"
brew "ask-cli"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "python@3.13"
brew "aws-sam-cli"
brew "awscli"
brew "azure-cli"
brew "caddy"
brew "glib"
brew "cloc"
brew "cmake"
brew "colordiff"
brew "cookiecutter"
brew "coreutils"
brew "cowsay"
brew "diff-so-fancy"
brew "docutils"
brew "ffmpeg"
brew "fortune"
brew "gcc"
brew "gifsicle"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "git-tools"
brew "gnupg"
brew "harfbuzz"
brew "uv"
brew "hatch"
brew "htop"
brew "imagemagick"
brew "jq"
brew "libdvdread"
brew "libdvdnav"
brew "libgit2"
brew "nmap"
brew "node@22"
brew "openjdk"
brew "pinentry-mac"
brew "protobuf"
brew "pyenv"
brew "pygments"
brew "python-tk@3.11"
brew "rust"
brew "showkey"
brew "tcl-tk"
brew "trash"
cask "blackhole-2ch"
cask "codex"
cask "font-meslo-lg-nerd-font"
cask "git-credential-manager"
cask "monitorcontrol"
cask "podman-desktop"
cask "proxy-audio-device"
